[
  "Tại sao người Nhật có ý thức công cộng rất cao ? Có lẽ do được giáo dục từ nhỏ (!?). Chả biết giáo trình môn giáo dục công dân của ta nội dung thế nào chứ đúng là ý thức của dân ta nơi công cộng còn kém thật ( từ người nhỏ đến người lớn ). Bài viết mới đề cập đến chuyện người với thiên nhiên. còn chuyện người với người nữa : thiếu tôn trọng nhau trong quan hệ cộng đồng : chen lấn bất cứ đâu, hát karaoke om sòm, sẵn sàng đánh chửi lộn khi bất bình gì đó dù rất nhỏ, hách dịch...",
  "Ở trường mẫu giáo, ý thức của trẻ rất tốt. Nhưng khi về nhà, cha mẹ chúng xấu như thế nào thì chúng cũng y như vậy. Không thể đổ cho giáo dục ở trường được.",
  "Một trong những chế tài để Công chức phục vụ tốt hơn và tiến tới văn minh hơn là văn hoá từ chức hoặc miễn nhiệm ngay và luôn khi không làm phục vụ nổi trách nhiệm của mình. Chế tài này phải được thực thi và triển khai luôn và ngay để xã hội vận hành đúng quy luật.",
  "Nếu chỉ căn cứ vào những điều trên thì tôi thấy không có gì cao siêu hay thiên tài cả. Xã hội văn minh hơn, kinh tế phát triển hơn cần những con người hoàn thiện hơn, tôi cũng mong con tôi được tốt đẹp bằng 70-80% các tiêu chí đó. ",
  "Học được thì tốt. Không học được thì thôi. Giáo dục không có mục tiêu cũng bị nói. Có mục tiêu thì bị bắt bẻ. Con bạn học giỏi là do bạn đã giáo dục được con bạn theo những tiêu chí nêu trong đó thôi, mặc dù bạn không tự đặt ra. Và đường đời còn rất dài. Vẫn còn ngồi trên ghế nhà trường thì chưa nói được là đã đủ tiêu chuẩn hay chưa.",
  "Bài viết rất hay, tổng hợp cụ thể và cách phản biện thật chặt chẽ, tôi thấy Giáo dục của chúng ta nặng về Thành tích và Giáo điều",
  "Là một phụ huynh có con sắp bước vào lớp 1, tôi không hi vọng gì nhiều vào 68 cái gạch đầu dòng của Bộ giáo dục. Điều tôi mong muốn là các cháu biết xếp hàng, biết cảm ơn, biết xin lỗi, biết nhường đường cho xe cấp cứu, biết dừng lại khi đèn đỏ, biết dành chỗ cho người già, trẻ con và phụ nữ có thai, không vứt rác và khạc nhổ bừa bãi,... Kiến thức rất rộng lớn và không phải cái gì học được ở trường cũng áp dụng được vào cuộc sống nhưng kỹ năng sống sẽ đi theo đứa trẻ ấy cả đời. Và ở ngoài đường, ng ta nhìn vào nhận thức, không nhìn vào bằng cấp và những bài học thuộc lòng mang nặng tính giáo điều.",
  "Đây là sản phẩm của các giáo sư tiến sỹ, nên các tiêu chí cũng phải ngang tầm tư duy của GSTS. Học sinh ở một vài khu vực thành phố lớn, còn nghe nói tới hội nhập quốc tế ,chứ các vùng còn lại mà nói đến hội nhập quốc tế thì khó quá! Rất may cho những ai về hưu trước năm 2020, chứ nếu còn đi dạy chắc chắn sẽ không hoàn thành được nhiệm vụ, bởi cho dù có cố gắng hết mức thì cũng bị nổ não vì rất khó cân đo đong đếm xem học sinh nào đạt được các tiêu chí, học sinh nào không đạt.Mong các GSTS xem lại.",
  "Tôi không đồng ý với tác giả . Tại sao công chức hay nhân viên hay gì gì nữa cũng là người làm công ăn lương . Hậu quả của tình trạng trên là tình trạng chây ỳ , không trách nhiệm . Phải thay đổi tư duy , khi cái cũ nó không phù hợp để sàng lọc lại cá nhân nào phù hợp hay không với từng vị trí nhất là cơ hội luôn dành cho ai có ý chí đạt được vị trí hằng mình muốn. Như vậy theo tôi tạo cho công chức suy nghĩ mình đã phục vụ cộng đồng đúng trách nhiệm chưa và mức độ đánh giá phản hồi ra sao , nếu không đạt thì phải có cơ chế lược bỏ thành phần không đạt để người khác thay thế",
  "Bài này khá chính xác ! Người viết có nghiên cứu sâu! Công chức thật ra lương khá thấp chỉ còn mỗi biên chế mà bỏ luôn thì chả còn gì lưu luyến",
  "Hy vọng việc phân định rõ ràng trên sẽ thu hút được nhiều tinh hoa của đất nước vào các cơ quan công quyền, giảm bớt tiêu cực nhất là tệ nạn chạy chức, chạy quyền, chạy biên chế, con ông cháu cha vv.",
  "Chả ai là không thay thế được, các doanh nghiệp tư vận hành không lẽ cũng phải ký hợp đồng cả đời mới duy trì được cty của mình, mới chính danh làm việc?!? Tôi nghĩ nên bỏ biên chế để dẹp bớt những người dốt, nhũng nhiễu.",
  "Tôi rất đồng tình với quan điểm của tác giả, Tiến sĩ đã phân tích rất rõ ràng, thấu đáo nhưng ngắn gọn, dễ hiểu về vấn đề này. Tôi cũng xin lưu ý với bạn đọc là trong bài này, tiến sĩ Nguyễn Sĩ Dũng chỉ phân tích vì sao không nên bỏ biên chế suốt đời chứ không đi sâu đề cập đến thực trạng, giải pháp nâng cao chất lượng đội ngũ công chức hiện nay (vì đây là một nội dung rất rộng, khuôn khổ một bài viết rất khó chuyển tải hết). Có thể nói tôi là người công tác cùng ngành với tiến sĩ Nguyễn Sĩ Dũng (tất nhiên ông không hề biết tôi) và đã đọc rất nhiều bài viết cũng như một đôi lần nghe ông phát biểu, cá nhân tôi rất tôn trọng và khâm phục ông",
  "Nếu cán bộ giỏi có đạo đức, có trình độ năng lực thực sự họ sẽ làm đâu cũng được. Còn ngược lại không có trình độ, đạo đức... chỉ muốn ngồi mãi.",
  "Nên bỏ luôn kỳ thi tốt nghiệp PTTH, chỉ cần học hết lớp 12 thì cấp cho một giấy chứng nhận đã hoàn thành chương trình học. Các trường đại học, cao đẳng hoặc trung học sẽ tự tổ chức thi tuuyển. Nếu em nào muốn tiếp tục vào đại học, cao đẳng... thì đều phải cố gắng học từ đầu để mà thi vào đại học chứ không phải thi tốt nghiệp, cơ hội sẽ được trao cho tất cả các em học sinh.",
  "Các trường đại học tự tuyển thì ai dám chắc không có tiêu cực? Tốt nhất là thi đại học tập trung như xưa Bài thi đưa về bộ đánh số và cắt phách sau đó giao cho các cơ sở chấm, chấm xong trả lại bộ ghép phách và lên điểm. Vì sao cả đời người chỉ một lần thi đại học để quyết định vận mệnh mà lại sợ tốn kém vài ba triệu để tổ chức kỳ thi không chặt chẽ tạo cơ hội chop những kẻ xấu cướp mất cơ hội của mình? không cần các ông tiết kiệm cho họ kiểu như vậy đâu!",
  "Cách phân quyền hợp lý nhất là trao trả các Sở GDĐT tổ chức thi (hoặc xét) tốt nghiệp THPT và trao trả việc tuyển sinh đầu vào cho các trường Đại học."
]