[
  [
    {
      "type": "text",
      "content": "Vụ thảm sát được phát hiện sáng 24.4 ở Bình Dương. 3 bà cháu tử vong trong nhà, trên người các nạn nhân có nhiều vết thương."
    },
    {
      "type": "image",
      "link": "https://image.thanhnien.vn/660/uploaded/vubang/2019_04_24/tham-sat-binh-duong-3_lutz.jpg"
    },
    {
      "type": "text",
      "content": "Thông tin ban đầu, vụ thảm sát được phát hiện trong sáng nay 24.4, lúc khoảng 7 giờ, tại khu phố Tân Ba, P.Thái Hòa, TX.Tân Uyên, Bình Dương.\n\nĐại tá Trịnh Ngọc Quyên, Giám đốc Công an Bình Dương, đã trực tiếp có mặt tại hiện trường, chỉ đạo điều tra phá án."
    },
    {
      "type": "image",
      "link": "https://image.thanhnien.vn/660/uploaded/vubang/2019_04_24/tham-sat-binh-duong-1_bjhe.jpg"
    },
    {
      "type": "text",
      "content": "Cũng theo thông tin ban đầu, các nạn nhân được xác định là bà ngoại (tên Cúc) và hai cháu ngoại.\n\nVụ việc được phát hiện khi một người con gái của bà Cúc đi làm về thì điếng người phát hiện mẹ và hai cháu tử vong. Nhận định ban đầu từ cơ quan chức năng, đây là một vụ án giết người cướp tài sản.\n\nThông tin ban đầu từ cơ quan điều tra, các nạn nhân gồm: Đào Thị Thu Cúc (54 tuổi, bà ngoại); Trần Thị Quỳnh Nhi (17 tuổi), Nguyễn Thị Bảo Ngân (7 tuổi, cùng là cháu ngoại của bà Cúc).\n\nCũng theo thông tin ban đầu, cháu Bảo Ngân ở gần nhà ngoại, tối 23.4 có qua ngủ với bà ngoại thì gặp nạn.\n\nThanh Niên sẽ tiếp tục cập nhật"
    }
  ],
  [
    {
      "type": "text",
      "content": "Tổng bí thư, Chủ tịch nước Nguyễn Phú Trọng gửi điện chia buồn đến Tổng thống Sri Lanka Maithripala Sirisena sau khi xảy ra các vụ đánh bom tại nước này."
    },
    {
      "type": "image",
      "link": "https://image.thanhnien.vn/660/uploaded/minhhung/2019_04_21/tbtct_flnl.jpg"
    },
    {
      "type": "text",
      "content": "Theo Bộ Ngoại giao ngày 21.4, Tổng bí thư, Chủ tịch nước Nguyễn Phú Trọng đã gửi điện chia buồn đến Tổng thống Sri Lanka Maithripala Sirisena sau khi xảy ra các vụ đánh bom tại nước này vào cùng ngày làm nhiều người thiệt mạng và bị thương.\n\nThủ tướng Nguyễn Xuân Phúc cũng đã gửi điện chia buồn đến Thủ tướng Ranil Wickremesinghe và Chủ tịch Quốc hội Nguyễn Thị Kim Ngân gửi điện chia buồn đến Chủ tịch Quốc hội Karu Jayasuriya.\n\nCùng ngày, Phó thủ tướng, Bộ trưởng Ngoại giao Phạm Bình Minh đã gửi điện chia buồn đến Bộ trưởng Ngoại giao Sri Lanka Tilak Janak Marapana.\n\nLiên quan đến việc bảo hộ công dân, ngày 21.4, Bộ Ngoại giao dẫn tin từ Đại sứ quán Việt Nam tại Sri Lanka cho biết trong hàng trăm người thương vong do các vụ nổ bom hàng loạt tại nhà thờ và khách sạn ở Sri Lanka, có nhiều công dân nước ngoài là nạn nhân.\n\nTheo chỉ đạo của Bộ Ngoại giao, Đại sứ quán Việt Nam tại Sri Lanka đã liên hệ với cơ quan chức năng sở tại và được biết cho đến nay chưa ghi nhận trường hợp công dân Việt Nam bị ảnh hưởng.\n\nBộ Ngoại giao đã chỉ đạo Đại sứ quán Việt Nam tại Sri Lanka tiếp tục theo dõi vụ việc, giữ liên lạc với cơ quan chức năng sở tại để cập nhật thông tin và có các biện pháp bảo hộ trong trường hợp cần thiết."
    }
  ]
]