[
  "Paper này mô tả về cách tấn công xe tự lái ( Tesla ) do nhóm Keen Lab ( Tencent ) thực hiện năm 2018 và trong tương lai gần đây cũng sẽ là 2 cách phổ biến tấn công vào xe tự lái/xe có kết nối internet, 2 cách như sau:\n\n1/ Dùng Fake 3G/Wifi để redirect Web Browser ( Webkit ) trên xe truy cập vào Website của người tấn công, sau đó nâng quyền lên Kernel Level và điều khiển xe qua hệ thống tự lái. ( Hình 1 )\n2/ Dùng adversarial ( mình có post mấy hôm trước ) để tấn công vào Neural Network của Tesla ( hình 4 và 5 ), từ đó khiến xe nhận diện sai làn và tự lái vào làn fake ( Hình 3 ), để tấn công có thể làm như hình 2, bôi 1 số vết sơn trông có vẻ vô hại trên đường nhưng qua Neural Network của xe nó sẽ nhận diện sai là Lane. ( Hay lúc ở BK mình có nói với các bạn là thậm chí có thể dùng 1 cách khác để khiến xe nhận diện đèn đỏ -> đèn xanh )",
  "Ô NHIỄM BỤI MỊN PM-2.5 Ở HÀ NỘI & VIỆT NAM\n\nGần đây chúng ta nhận được nhiều cảnh báo về mức độ ô nhiễm bụi mịn PM-2.5 của Hà Nội. Nhiều bài báo đưa ra thông tin Hà Nội ô nhiễm bụi mịn PM-2.5 ở mức báo động, đứng thứ 2 Đông Nam Á, thậm chí đứng thứ 2 thế giới, ảnh hưởng nghiêm trọng đến sức khoẻ và tuổi thọ của con người.\n\nTôi không có ý định biện minh cho ô nhiễm bụi mịn PM-2.5 của Hà Nội. Điều tôi muốn là làm rõ thực chất bụi mịn PM-2.5 ở Hà Nội ô nhiễm ở mức độ nào, nguy hại đến đâu, ảnh hưởng thế nào đến sức khoẻ và tuổi thọ của con người và chúng ta làm cách nào để hạn chế thấp nhất ảnh hưởng của bụi mịn PM-2.5?\n\nBụi mịn PM-2.5 là thành phần chính cùng với các bụi mịn PM-10, TSP, Ô xít nito NO2, Sulfur dioxide SO2, Carbon monoxit CO và O3 tạo nên chất lượng không khí AQI.\n\nBụi mịn PM-2.5 có đường kính rất nhỏ, cỡ 2,5 micromet (khoảng 3% đường kính sợi tóc). Bụi mịn PM-2.5 là chất thải ra từ các nhà máy điện, từ chất thải của ô tô, xe máy, máy bay và các động cơ đốt nhiên liệu, từ các vụ cháy rừng và đốt các chế phẩm nông nghiệp, phun trào núi lửa và bão bụi.\n\nVì có kích thước rất nhỏ và rất nhẹ, nên bụi mịn PM-2.5 bay lơ lửng trong không khí lâu và có thể dễ dàng đi qua mũi và cổ họng để xâm nhập vào phổi, làm tăng khả năng mắc bệnh tim, bệnh phổi, viêm phế quản, hen suyễn, bệnh hô hấp khác. Nguy hại hơn chúng có thể làm tăng nguy cơ tử vong do ung thư phổi và tăng dị tật bẩm sinh đối với các bà mẹ mang thai.\n\nTheo báo cáo của AirVisual, chỉ số PM-2.5 trung bình của Hà Nội năm 2017 là 45.8 và năm 2018 là 40.8, ở mức có ảnh hưởng đối với những người nhậy cảm với bệnh tim và phổi, xếp hạng 209 thế giới. Còn TP Hồ Chí Minh chỉ số PM-2.5 năm 2017 và 2018 là 23.6 và 26.9, ở mức bình thường, xếp hạng 452 thế giới. Tuy Hà Nội có chỉ số bụi mịn PM-2.5 cao, nhưng lại có điểm tốt là chỉ số bụi mịn PM-2.5 năm 2018 đã giảm 11% so với năm 2017, còn TP Hồ Chí Minh tuy chỉ số bụi mịn PM-2.5 thấp nhưng năm 2018 lại tăng 14% so với năm 2017.\n\nNgười ta chia chỉ số bụi mịn PM-2.5 ra 6 mức ô nhiễm như sau:\n1. Mức 1: tốt (PM-2.5 nhỏ hơn 12), màu xanh\n2. Mức 2: bình thường (từ 12-35.4), màu vàng.\n3. Mức 3: chỉ ảnh hưởng đến nhóm người nhậy cảm với bệnh tim, phổi (từ 35.5-55.4), màu cam.\n4. Mức 4: ảnh hưởng đến sức khoẻ (từ 55.5-150.4), màu đỏ.\n5. Mức 5: rất ảnh hưởng (từ 150.5-250.4), màu tím.\n6. Mức 6: nguy hại (từ 250.5-500.4), màu nâu.\n\nTheo kết quả đo đạc hơn 3.058 thành phố trên thế giới thì 100% các thành phố đều ô nhiễm bụi mịn PM-2.5 ở các mức độ lớn nhỏ khác nhau. Ba TP ô nhiễm thấp nhất thuộc Úc với chỉ số PM-2.5 là 2.2-2.6. Hai TP ô nhiễm lớn nhất thuộc Ấn Độ có chỉ số PM-2.5 là 144.6 và 145.6.\n\nTheo bảng chia nhóm bụi mịn trên thì chỉ số bụi mịn PM-2.5 của Hà Nội năm 2017, 2018 đang ở khoảng giữa của mức 3 (màu cam), tức chỉ ảnh hưởng đến nhóm người nhậy cảm với bệnh tim, bệnh phổi, chưa đến mức 4 (ảnh hưởng đến sức khoẻ), càng chưa đến mức 5 (rất ảnh hưởng) và mức 6 (nguy hại).\n\nChi tiết hơn thì mức độ ô nhiễm PM-2.5 của Hà Nội cao hơn về mùa đông, thấp hơn về mùa hè. Trong 12 tháng của năm, mức độ ô nhiễm PM-2.5 của Hà Nội phân bố như sau:\n1. Các tháng ô nhiễm bình thường (màu vàng) là 5 tháng mùa hè (từ tháng 5 đến tháng 9), chỉ số PM-2.5 chỉ ở mức từ 17.0 đến 22.3\n2. Các tháng ảnh hưởng đến nhóm người nhạy cảm với bệnh tim, bệnh phổi (màu cam) là 4 tháng 3, 4, 10 và 12, chỉ số PM-2.5 từ 37.0 đến 46.7\n3. Các tháng ảnh hưởng đến sức khỏe (màu đỏ) là 3 tháng 1, 2 và tháng 11, chỉ số PM-2.5 ở mức 56.5 đến 63.6\n4. Không có tháng nào ở mức rất ảnh hưởng và mức nguy hại đến sức khoẻ\n\nVới những thông tin này, người dân Hà Nội cứ bình tĩnh, không nên hốt hoảng và lo lắng quá mức, bởi không phải tháng nào trong năm Hà Nội cũng ô nhiễm PM-2.5 cao cả, suốt 5 tháng mùa hè (5, 6, 7, 8, 9) không khí Hà Nội ở mức bình thường, người dân có thể ra ngoài trời vui chơi, sinh hoạt, đi lại thoải mái mà không lo bụi mịn PM-2.5; Trong 4 tháng 3, 4, 10 và 12 thì những ai bị nhậy cảm với bệnh tim, phổi mới cần hạn chế tiếp xúc với không khí ngoài trời; Người dân Hà Nội chỉ cần đặc biệt lưu ý 3 tháng 1, 2 và 11 là những tháng mà mức độ ô nhiễm PM-2.5 ở mức ảnh hưởng đến sức khoẻ, nếu tiếp xúc với không khí ngoài trời nhiều.\n\nÔ nhiễm bụi mịn PM-2.5 của Hà Nội đứng thứ 209, là mức cao ở khu vực Đông Nam Á, chỉ đứng sau Jakarta của Indonesia, vì vậy chính quyền Hà Nội và chính phủ cần hành động quyết liệt để nghiên cứu, ra chính sách và thực thi các biện pháp nhằm giảm mức độ ô nhiễm bụi mịn PM-2.5 cũng như giảm mức độ ô nhiễm không khí AQI của Hà Nội và các TP khác của Việt Nam.\n\nTóm lại ô nhiễm bụi mịn PM-2.5 được chia làm 6 mức, Hà Nội ô nhiễm ở mức 3, mức ảnh hưởng đến nhóm người nhạy cảm với bệnh tim, phổi, còn TP Hồ Chí Minh ô nhiễm ở mức 2, mức bình thường.\n\nHy vọng bài viết này giúp các bạn đang sinh sống, làm việc, công tác, du lịch ở Hà Nội có cái hiểu đúng và chính xác cũng như có các phương án phòng chống ô nhiễm bụi mịn PM-25 cho cá nhân và người thân một cách hiệu quả.",
  "SỰ THẬT VỀ Ô NHIỄM KHÔNG KHÍ Ở HÀ NỘI & VIỆT NAM\n\nGần đây chúng ta thường đọc được những thông tin khủng khiếp về ô nhiễm không khí ở Hà Nội và Việt Nam từ các báo chí Việt Nam lẫn BBC tiếng Việt: “Hà Nội là TP ô nhiễm không khí thứ nhì thế giới”, “Hà Nội ô nhiễm không khí cao thứ 2 Đông Nam Á”, “Hà Nội ô nhiễm không khí cao thứ 12 thế giới, TP Hồ Chí Minh cao thứ 15”, với những cảnh báo “chúng sẽ đau ốm và/hoặc sẽ chết sớm vì không khí ô nhiễm”.\n\nRất nhiều bạn fb viết stt, chụp ảnh mờ ảo khói bụi của Hà Nội để minh chứng cho bài viết về ô nhiễm không khí, về bụi mịn của Hà Nội.\n\nMấy hôm nay ở Singapore, sáng sáng trên tầng 25 nhìn Singapore thấy cũng mờ ảo, gần giống như bức ảnh mà các báo và các bạn fb đăng về ô nhiễm không khí của Hà Nội.\n\nĐi tìm sự thật, tôi vào các trang AirVisual, Waqi (World Air Quality Index), Aqicn... (những tổ chức mà báo chí, BBC dẫn nguồn). Hoá ra sự thật là Hà Nội, TP Hồ Chí Minh và Việt Nam không ô nhiễm khủng khiếp, không ở thứ hạng nhì thế giới, nhì châu Á, nhì Đông Nam Á như các báo Việt Nam và BBC đã đưa.\n\nSỐ LIỆU THỰC NGÀY 29-30/03/2019\n\nTrong trang WAQI World’s Air Pollution (Ô nhiễm không khí thế giới), phần Real-Time Air Quality Index (Chất lượng không khí thời gian thực) có đưa ra bản đồ chất lượng không khí các TP trên thế giới, kết quả trên bản đồ vào 8h00 sáng Singapore (7h00 sáng Hà Nội):\n1. Chỉ số AQI của Hà Nội là 65, mức độ vừa phải, của TP Hồ Chí Minh là 61, của Đà Nẵng là 138 (kém).\n2. Có đến hơn 10 TP của Hàn Quốc mức độ ô nhiễm cao hơn Hà Nội, ở mức kém (AQI 119-142).\n3. Có đến hơn 200 TP của Trung Quốc mức độ ô nhiễm cao hơn Hà Nội, ở mức kém, xấu, thậm chí rất xấu (AQI trên 200).\n4. Có đến vài chục TP ở Thái Lan mức độ ô nhiễm cao hơn Hà Nội, ở mức kém, xấu, rất xấu, thậm chí nguy hại (AQI 373-424).\n5. Ấn Độ, Bangladesh và các nướ Nam Á thì miễn bàn.\n6. Vào đúng giờ ấy (8h sáng Singapore và 7h sáng Hà Nội), Singapore cũng ô nhiễm hơn Hà Nội (Singapore 80, Hà Nội 65).\n\nTất nhiên là bắt đầu từ 8h30 sáng (Hà Nội) trở đi mức ô nhiễm ở Hà Nội tăng dần và từ 10h trở đi AQI của Hà Nội ở mức 114-119 (kém), khi ấy cao hơn Singapore.\n\nSố liệu sáng nay, Hà Nội và Đà Nẵng cao hơn ngày hôm qua (hiện tại Hà Nội 100, Đà Nẵng 161, tuy nhiên tương quan với các TP khác của Hàn Quốc, Trung Quốc, Thái Lan... vẫn như hôm qua.\n\nTHỰC CHẤT VỀ Ô NHIỄM CỦA HÀ NỘI, VIỆT NAM\n\nTrong trang AirVisual đưa ra bảng ô nhiễm không khí của 87 TP trên thế giới ngày 29 và 30/03/2019 (9h sáng) như sau:\n1. Hà Nội xếp thứ 39 và 34 trên tổng số 87 thành phố (AQI là 70 và 80)\n2. Các TP ô nhiễm nhất là Chiang Mai (Thái Lan), Dhaka (Bangladesh), Lahore (Pakistan) với AQI trên 200.\n3. Về chỉ số bụi mịn PM2.5, Hà Nội xếp thứ 209 thế giới, với chỉ số 40.8. Điểm đáng mừng là chỉ số bụi mịn PM2.5 của Hà Nội năm 2018 giảm 9.33% so với năm 2017. \nLưu ý rằng không phải ô nhiễm thứ 2 thế giới, thứ 2 châu Á như các báo đưa tin. Thực chất Hà Nội xếp thứ 12 thế giới và thứ 2 Đông Nam Á là trong danh sách các THỦ ĐÔ, chứ không phải danh sách các thành phố.\n4. Về chỉ số bụi mịn PM2.5, Việt Nam xếp thứ 17 thế giới.\n\nTrang AQICN xếp hạng chất lượng không khí các quốc gia (ngày 29/03/2019) như sau:\n1. Với chỉ số AQI 119 (kém), Việt Nam xếp thứ 28 trên 72 quốc gia.\n2. Bất ngờ là Mỹ xếp hạng ô nhiễm thứ 7 thế giới (AQI rất xấu 239), Úc xếp hạng ô nhiễm thứ 5 thế giới (AQI ở mức nguy hại 406).\n3. Bất ngờ là danh sách các quốc gia ô nhiễm hơn Việt Nam có cả Anh, Pháp, Hà Lan, Bỉ, Hà Quốc, Canada, Ba Lan, Tây Ban Nha...\n\n(Số liệu sáng nay thì Việt Nam AQI 162 xếp hạng 15 trên 72, Mỹ với AQI 467 còn xếp hạng ô niễm thứ 5).\nVới số liệu như trên thì tôi cho rằng chúng ta đang bị cảnh báo quá mức về ô nhiễm không khí của Hà Nội và Việt Nam, bởi ô nhiễm không khí đang là vấn đề của cả thế giới chứ không phải của riêng Hà Nội và Việt Nam.\n\nPS: Để có bức tranh tổng thể về ô nhiễm của Hà Nội và Việt Nam, các bạn xem bức ảnh về ô nhiễm của các Tp Châu Á tôi chụp lại màn hình sáng hôm qua.",
  "VIỆT NAM CÓ LÀ QUỐC GIA HẠNH PHÚC?\n\nChúng ta từng nghe Việt Nam là quốc gia hạnh phúc thứ 5, thậm trí thứ 2 thế giới, nhưng chúng ta cũng từng nghe Việt Nam chỉ là quốc gia hạnh phúc thứ 95 thế giới thôi.\n\nNhững người lạc quan thì tin và vui mừng với vị trí quốc gia hạnh phúc thứ 5 thế giới và không hài lòng với vị trí thứ 95 thế giới. Còn những người có cái nhìn tiêu cực về Việt Nam thì dè bỉu vị trí hạnh phúc thứ 95 và cho rằng vị trí thứ 5 là rất khôi hài, ai đời nghèo thế, y tế, giáo dục, giao thông như thế, ô nhiễm môi trường, thức ăn độc hại như thế... mà hạnh phúc thứ 5 thế giới ai mà tin được.\n\nVậy theo bạn Việt Nam có là quốc gia hạnh phúc, và Việt Nam nằm ở vị trí nào trong bảng xếp hạng các quốc gia hạnh phúc của thế giới?\n\nThực ra hạnh phúc không hề có một định nghĩa duy nhất, mỗi người chúng ra quan niệm về hạnh phúc khác nhau. Thế cho nên quan niệm thế nào là một quốc gia hạnh phúc cũng rất khác nhau, tuỳ quan niệm. Trên thế giới có 2 tổ chức hàng năm xếp hạng các quốc gia hạnh phúc là Liên Hiệp Quốc (United Nation) với báo cáo World Happiness và New Economic Foundation NEF (Vương quốc Anh) với báo cáo Happy Planet Index.\n\nTrong khi Liên hiệp quốc đo quốc gia Hạnh Phúc theo 6 tiêu chí: Kinh tế giàu nghèo (thu nhập theo đầu người), hỗ trợ xã hội, tuổi thọ trung bình, tự do lựa chọn cuộc sống, sự rộng lượng và nhận thức tham những, còn NEK vương quốc Anh lại đo hạnh phúc theo 3 tiêu chí: Mức độ hài lòng với cuộc sống, tuổi thọ trung bình, hành vi tác động đến môi trường.\n\nNhư vậy LHQ cho rằng giàu hay nghèo và sự nhận thức về tham nhũng là hai yếu tố quan trọng quyết định đến hạnh phúc của mỗi cá nhân, của mỗi quốc gia, còn NEK lại cho rằng cứ hài lòng với cuộc sống là hạnh phúc, không cần biết giàu có hay nghèo đói, không cần biết nhận thức về tham nhũng cao hay thấp. Đấy là nguyên nhân chính của việc thứ hạng quốc gia hạnh phúc của Việt Nam giữa xếp hạng của NEK và xếp hạng của LHQ lệch nhau đến 90 bậc.\n\nCá nhân tôi thì cho rằng không có một chuẩn duy nhất để có thể khẳng định Việt Nam chúng ta đứng thứ bao nhiêu trong bảng xếp hạng các quốc gia hạnh phúc. Theo 6 tiêu chí hạnh phúc của LHQ thì Việt Nam đứng thứ 95, còn theo 3 tiêu chí hạnh phúc của NEK thì Việt Nam đứng thứ 5 trong bảng xếp hạng các quốc gia hạnh phúc, cả hai đều đúng cả.\n\nChúng ta phải thừa nhận rằng kinh tế, tiền bạc nó sẽ giúp cho chúng ta làm được nhiều việc, từ cái ăn, cái mặc, chỗ ở, chăm sóc sức khoẻ, học hành nâng cao trình độ, giải trí, đi du lịch, phụng dưỡng cha mẹ, giúp đỡ người thân, giúp đỡ bạn bè, làm từ thiện.... Chính vì thế kinh tế và tiền bạc giúp cho chúng ta tiến tới cuộc sống hạnh phúc.\n\nTrong thực tế tôi biết rất nhiều người không thật giàu có, nhưng họ rất hạnh phúc, hạnh phúc hiện rõ trên nét mặt rạng ngời, nụ cười thường trực trên môi, lý do đơn giản là: họ và con cái họ thành đạt trên mức mong đợi, cuộc sống, sự nghiệp của họ mỗi ngày, mỗi tháng, mỗi năm đều tốt hơn, ngày hôm nay luôn tốt hơn ngày hôm qua. Đấy chính là quan điểm của NEK về hạnh phúc và tôi rất thích quan điểm hạnh phúc này.",
  "VIỆT NAM CÓ GÌ HAY\n\nTừ ngày dùng facebook thấy có khá nhiều bạn có cái nhìn thiếu tích cực về Việt Nam, nào là quốc gia nghèo khó, thu nhập đầu người thấp, kinh tế càng ngày càng tụt hậu, tham nhũng tràn lan, giáo dục lạc hậu, y tế quá tải, giao thông ùn tắc, không khí ô nhiễm, thực phẩm bẩn, độc hại..., từ đó một số bạn khái quát là “đến cái cột điện mà biết đi cũng bỏ nước mà ra đi”.\n\nThế nhưng thực tế là chúng ta và hơn 95 triệu người dân Việt Nam vẫn đang hàng ngày sinh sống, học tập và làm việc trên đất nước Việt Nam này.\n\nSống ở một quốc gia, sống ở một xã hội mà không yêu quí nó, không trân trọng nó, suốt ngày bới lông tìm vết, tìm điểm xấu, tìm cái dở để chỉ trích, chê bai, dè bỉu thì đúng là không thể hạnh phúc; sống như thế thì khổ lắm, không những khổ mình mà còn khổ gia đình, người thân, bạn bè, đồng nghiệp, khổ cả những người xung quanh nữa.\n\nChính vì vậy tôi đi tìm các điểm tích cực, các điểm tốt, xem Việt Nam liệu có gì hay, có gì tốt để cuộc sống thêm lạc quan, thêm hạnh phúc. Hay tốt ở đây là hay tốt theo chuẩn quốc tế, được các tổ chức quốc tế ghi nhận bằng những số liệu khách quan, chứ không phải hay theo kiểu tự sướng.\n\nSau đây là những điểm hay, điểm tốt của Việt Nam được các tổ chức quốc tế ghi nhận:\n1. Đất nước không có khủng bố: đứng số 1 thế giới\n2. Tác động kinh tế của bạo lực và xung đột: thấp thứ 21 thế giới\n3. Số người chết vì cháy nổ: thấp thứ 24 thế giới\n4. Tội phạm giết người: Trong nhóm 25% thấp nhất thế giới\n5. Chết vì tự tử: Trong nhóm 35% thấp nhất thế giới\n6. Tăng trưởng kinh tế: Thuộc top 5 quốc gia cao nhất thế giới\n7. Hạnh phúc và hài lòng với cuộc sống: Thứ 95 hay top 5 quốc gia hạnh phúc\n\nĐẤT NƯỚC KHÔNG CÓ KHỦNG BỐ\n\nTheo diễn đàn kinh tế thế giới WEF, Việt Nam là quốc gia không có tổ chức khủng bố, năm 2018 được 100 điểm tuyệt đối, cùng 21 quốc gia xếp số 1 thế giới về an ninh.\n\nTheo Viện kinh tế và hoà bình IEP (Úc), tính 20 năm (1998-2017), Việt Nam được xếp hạng 104 trên 138 quốc gia trong danh sách quốc gia về tội phạm khủng bố. Các bạn có biết trong khi đó Mỹ, Anh, Pháp, Đức, Canada, Úc, Nhật và một số nước châu Âu giàu có khác lại đứng thứ 20 đến 68 trong danh sách các quốc gia khủng bố, với điểm số cao gấp Việt Nam từ 5 đến 10 lần. Trong Asean Philippines, Thái Lan, Myanmar, Indonesia, Malaysia lần lượt xếp thứ 10, 17, 24, 42 và 70 thế giới, với điểm số cao gấp Việt Nam từ 4 đến 11 lần.\n\nBẠO LỰC VÀ XUNG ĐỘT\n\nTheo Viện kinh tế và Hoà bình IEP (Úc), Việt Nam được xếp thứ 21 trên 163 quốc gia về tiêu chí kinh tế ít chịu tác động của bạo lực và xung đột, trong khi đó Mỹ, Anh, Pháp, Úc, Ba Lan, Hungary, Hàn Quốc, Singapore... đều bị tác động lớn hơn Việt Nam rất nhiều.\n\nCHÁY NỔ VÀ GIẾT NGƯỜI\n\nTheo tổ chức Y tế thế giới WHO, Việt Nam được xếp thứ 24 trên 183 quốc gia có tỷ lệ chết người do cháy nổ thấp nhất thế giới.\n\nTheo diễn đàn kinh tế thế giới WEF, Việt Nam được xếp hạng 49 trên 140 quốc gia, tính theo số vụ giết người thấp nhất thế giới.\n\nTỰ TỬ\n\nTheo tổ chức Y tế thế giới WHO, Việt Nam thuộc top 35% quốc gia ít tự tử (đứng thứ 126 trên 183 quốc gia, tính theo số người chết do tự tử trong 100.000 dân).\n\nĐiểm rất lạ là các nước Âu, Mỹ, Hàn Quốc, Nhật Bản... lại có số người chết do tự tử cao hơn, thậm chí rất cao. Các nước giàu có có số người chết do tự tử cao có thể kể đến Hàn Quốc (cao thứ 10 thế giới), Bỉ (22), Nhật Bản (26), Phần Lan(36), Thuỵ Điển (42), Pháp (45), Mỹ (47), New Zealand (52), Áo (62), Thuỵ Sĩ (75), Úc (84), Hà Lan, Na Uy, Đan Mạch.... Bên cạnh chúng ta Thái Lan xếp thứ 44 và Singapore xếp thứ...\n\nHoá ra không phải cứ giàu có là hạnh phúc.\n\nTĂNG TRƯỞNG KINH TẾ CAO\n\nTheo con số thống kê của các tổ chức quốc tế (WB, IMF, UN...), Việt Nam thuộc top 5 quốc gia có tốc độ tăng trưởng kinh tế (GDP đầu người) cao nhất thế giới trong vòng 25 năm (1991-2016).\n\nTrong 25 năm (1991-2016), mức sống của người dân Việt Nam đã được nâng lên 3.87 lần, chỉ sau các nước Guinea xích đạo, Trung Quốc, Myanmar và Iraq. Cũng trong khoảng thời gian này Mỹ, Anh, Đức, Pháp, Nhật Bản, Canada, Úc, Italy và các nước Tây Âu chỉ nâng được có 1.15 đến 1.69 lần, còn các nước Asean như Philippines, Thái Lan, Indonesia, Malaysia, Singapore chỉ nâng lên được có 1.86, 2.20, 2.22, 2.28 và 2.32 lần.\n\nĐiểm này quan trọng lắm. Cuộc sống cứ năm nay tốt hơn năm trước, ngày hôm nay tốt hơn ngày hôm qua là vui, là hạnh phúc, còn cứ dậm chân tại chỗ, hoặc thụt lùi thì ai cũng không vui cả, kể cả người giàu.\n\n(tiếp: Việt Nam có là quốc gia Hạnh phúc)"
]